; domain
(define (domain transport-strips)
(:requirements :typing :action-costs)

(:types location fuellevel locatable - object 
	package truck - locatable
)

(:predicates 
(connected ?l1 ?l2 - location)
(at ?o - locatable ?l - location)
(in ?p - package ?t - truck)
(fuel ?t - truck ?level - fuellevel)
(fuelcost ?level - fuellevel ?l1 ?l2 - location)
(sum ?a ?b ?c - fuellevel)
)

(:functions 
(total-cost) - number)

(:action LOAD
:parameters
(?p - package
?t - truck
?l - location)
:precondition
(and (at ?t ?l) (at ?p ?l))
:effect
(and (not (at ?p ?l)) (in ?p ?t) (increase (total-cost) 1))
)

(:action UNLOAD
:parameters
(?p - package
?t - truck
?l - location)
:precondition
(and (at ?t ?l) (in ?p ?t))
:effect
(and (at ?p ?l) (not (in ?p ?t)) (increase (total-cost) 1))
)

(:action DRIVE
:parameters
(?t - truck
?l1 - location
?l2 - location
?fuelpost - fuellevel
?fueldelta - fuellevel
?fuelpre - fuellevel)
:precondition
(and 
(connected ?l1 ?l2)
(fuelcost ?fueldelta ?l1 ?l2)
(fuel ?t ?fuelpre)
(sum ?fuelpost ?fueldelta ?fuelpre)
(at ?t ?l1)
)
:effect
(and (not (at ?t ?l1)) 
     (at ?t ?l2) 
     (not (fuel ?t ?fuelpre)) 
     (fuel ?t ?fuelpost)
     (increase (total-cost) 1))
)

)

; problem
(define (problem transport-l5-t1-p13---int100n150-m25---int100c200---s443---e0)
(:domain transport-strips)

(:objects
l0 l1 l2 l3 l4 - location
t0 - truck
p0 p1 p2 p3 p4 p5 p6 p7 p8 p9 p10 p11 p12 - package
level0 level1 level2 level3 level4 level5 level6 level7 level8 level9 level10 level11 level12 level13 level14 level15 level16 level17 level18 level19 level20 level21 level22 level23 level24 level25 level26 level27 level28 level29 level30 level31 level32 level33 level34 level35 level36 level37 level38 level39 level40 level41 level42 level43 level44 level45 level46 level47 level48 level49 level50 level51 level52 level53 level54 level55 level56 level57 level58 level59 level60 level61 level62 level63 level64 - fuellevel
)

(:init
(sum level0 level3 level3)
(sum level0 level5 level5)
(sum level0 level6 level6)
(sum level0 level7 level7)
(sum level0 level8 level8)
(sum level0 level10 level10)
(sum level1 level3 level4)
(sum level1 level5 level6)
(sum level1 level6 level7)
(sum level1 level7 level8)
(sum level1 level8 level9)
(sum level1 level10 level11)
(sum level2 level3 level5)
(sum level2 level5 level7)
(sum level2 level6 level8)
(sum level2 level7 level9)
(sum level2 level8 level10)
(sum level2 level10 level12)
(sum level3 level3 level6)
(sum level3 level5 level8)
(sum level3 level6 level9)
(sum level3 level7 level10)
(sum level3 level8 level11)
(sum level3 level10 level13)
(sum level4 level3 level7)
(sum level4 level5 level9)
(sum level4 level6 level10)
(sum level4 level7 level11)
(sum level4 level8 level12)
(sum level4 level10 level14)
(sum level5 level3 level8)
(sum level5 level5 level10)
(sum level5 level6 level11)
(sum level5 level7 level12)
(sum level5 level8 level13)
(sum level5 level10 level15)
(sum level6 level3 level9)
(sum level6 level5 level11)
(sum level6 level6 level12)
(sum level6 level7 level13)
(sum level6 level8 level14)
(sum level6 level10 level16)
(sum level7 level3 level10)
(sum level7 level5 level12)
(sum level7 level6 level13)
(sum level7 level7 level14)
(sum level7 level8 level15)
(sum level7 level10 level17)
(sum level8 level3 level11)
(sum level8 level5 level13)
(sum level8 level6 level14)
(sum level8 level7 level15)
(sum level8 level8 level16)
(sum level8 level10 level18)
(sum level9 level3 level12)
(sum level9 level5 level14)
(sum level9 level6 level15)
(sum level9 level7 level16)
(sum level9 level8 level17)
(sum level9 level10 level19)
(sum level10 level3 level13)
(sum level10 level5 level15)
(sum level10 level6 level16)
(sum level10 level7 level17)
(sum level10 level8 level18)
(sum level10 level10 level20)
(sum level11 level3 level14)
(sum level11 level5 level16)
(sum level11 level6 level17)
(sum level11 level7 level18)
(sum level11 level8 level19)
(sum level11 level10 level21)
(sum level12 level3 level15)
(sum level12 level5 level17)
(sum level12 level6 level18)
(sum level12 level7 level19)
(sum level12 level8 level20)
(sum level12 level10 level22)
(sum level13 level3 level16)
(sum level13 level5 level18)
(sum level13 level6 level19)
(sum level13 level7 level20)
(sum level13 level8 level21)
(sum level13 level10 level23)
(sum level14 level3 level17)
(sum level14 level5 level19)
(sum level14 level6 level20)
(sum level14 level7 level21)
(sum level14 level8 level22)
(sum level14 level10 level24)
(sum level15 level3 level18)
(sum level15 level5 level20)
(sum level15 level6 level21)
(sum level15 level7 level22)
(sum level15 level8 level23)
(sum level15 level10 level25)
(sum level16 level3 level19)
(sum level16 level5 level21)
(sum level16 level6 level22)
(sum level16 level7 level23)
(sum level16 level8 level24)
(sum level16 level10 level26)
(sum level17 level3 level20)
(sum level17 level5 level22)
(sum level17 level6 level23)
(sum level17 level7 level24)
(sum level17 level8 level25)
(sum level17 level10 level27)
(sum level18 level3 level21)
(sum level18 level5 level23)
(sum level18 level6 level24)
(sum level18 level7 level25)
(sum level18 level8 level26)
(sum level18 level10 level28)
(sum level19 level3 level22)
(sum level19 level5 level24)
(sum level19 level6 level25)
(sum level19 level7 level26)
(sum level19 level8 level27)
(sum level19 level10 level29)
(sum level20 level3 level23)
(sum level20 level5 level25)
(sum level20 level6 level26)
(sum level20 level7 level27)
(sum level20 level8 level28)
(sum level20 level10 level30)
(sum level21 level3 level24)
(sum level21 level5 level26)
(sum level21 level6 level27)
(sum level21 level7 level28)
(sum level21 level8 level29)
(sum level21 level10 level31)
(sum level22 level3 level25)
(sum level22 level5 level27)
(sum level22 level6 level28)
(sum level22 level7 level29)
(sum level22 level8 level30)
(sum level22 level10 level32)
(sum level23 level3 level26)
(sum level23 level5 level28)
(sum level23 level6 level29)
(sum level23 level7 level30)
(sum level23 level8 level31)
(sum level23 level10 level33)
(sum level24 level3 level27)
(sum level24 level5 level29)
(sum level24 level6 level30)
(sum level24 level7 level31)
(sum level24 level8 level32)
(sum level24 level10 level34)
(sum level25 level3 level28)
(sum level25 level5 level30)
(sum level25 level6 level31)
(sum level25 level7 level32)
(sum level25 level8 level33)
(sum level25 level10 level35)
(sum level26 level3 level29)
(sum level26 level5 level31)
(sum level26 level6 level32)
(sum level26 level7 level33)
(sum level26 level8 level34)
(sum level26 level10 level36)
(sum level27 level3 level30)
(sum level27 level5 level32)
(sum level27 level6 level33)
(sum level27 level7 level34)
(sum level27 level8 level35)
(sum level27 level10 level37)
(sum level28 level3 level31)
(sum level28 level5 level33)
(sum level28 level6 level34)
(sum level28 level7 level35)
(sum level28 level8 level36)
(sum level28 level10 level38)
(sum level29 level3 level32)
(sum level29 level5 level34)
(sum level29 level6 level35)
(sum level29 level7 level36)
(sum level29 level8 level37)
(sum level29 level10 level39)
(sum level30 level3 level33)
(sum level30 level5 level35)
(sum level30 level6 level36)
(sum level30 level7 level37)
(sum level30 level8 level38)
(sum level30 level10 level40)
(sum level31 level3 level34)
(sum level31 level5 level36)
(sum level31 level6 level37)
(sum level31 level7 level38)
(sum level31 level8 level39)
(sum level31 level10 level41)
(sum level32 level3 level35)
(sum level32 level5 level37)
(sum level32 level6 level38)
(sum level32 level7 level39)
(sum level32 level8 level40)
(sum level32 level10 level42)
(sum level33 level3 level36)
(sum level33 level5 level38)
(sum level33 level6 level39)
(sum level33 level7 level40)
(sum level33 level8 level41)
(sum level33 level10 level43)
(sum level34 level3 level37)
(sum level34 level5 level39)
(sum level34 level6 level40)
(sum level34 level7 level41)
(sum level34 level8 level42)
(sum level34 level10 level44)
(sum level35 level3 level38)
(sum level35 level5 level40)
(sum level35 level6 level41)
(sum level35 level7 level42)
(sum level35 level8 level43)
(sum level35 level10 level45)
(sum level36 level3 level39)
(sum level36 level5 level41)
(sum level36 level6 level42)
(sum level36 level7 level43)
(sum level36 level8 level44)
(sum level36 level10 level46)
(sum level37 level3 level40)
(sum level37 level5 level42)
(sum level37 level6 level43)
(sum level37 level7 level44)
(sum level37 level8 level45)
(sum level37 level10 level47)
(sum level38 level3 level41)
(sum level38 level5 level43)
(sum level38 level6 level44)
(sum level38 level7 level45)
(sum level38 level8 level46)
(sum level38 level10 level48)
(sum level39 level3 level42)
(sum level39 level5 level44)
(sum level39 level6 level45)
(sum level39 level7 level46)
(sum level39 level8 level47)
(sum level39 level10 level49)
(sum level40 level3 level43)
(sum level40 level5 level45)
(sum level40 level6 level46)
(sum level40 level7 level47)
(sum level40 level8 level48)
(sum level40 level10 level50)
(sum level41 level3 level44)
(sum level41 level5 level46)
(sum level41 level6 level47)
(sum level41 level7 level48)
(sum level41 level8 level49)
(sum level41 level10 level51)
(sum level42 level3 level45)
(sum level42 level5 level47)
(sum level42 level6 level48)
(sum level42 level7 level49)
(sum level42 level8 level50)
(sum level42 level10 level52)
(sum level43 level3 level46)
(sum level43 level5 level48)
(sum level43 level6 level49)
(sum level43 level7 level50)
(sum level43 level8 level51)
(sum level43 level10 level53)
(sum level44 level3 level47)
(sum level44 level5 level49)
(sum level44 level6 level50)
(sum level44 level7 level51)
(sum level44 level8 level52)
(sum level44 level10 level54)
(sum level45 level3 level48)
(sum level45 level5 level50)
(sum level45 level6 level51)
(sum level45 level7 level52)
(sum level45 level8 level53)
(sum level45 level10 level55)
(sum level46 level3 level49)
(sum level46 level5 level51)
(sum level46 level6 level52)
(sum level46 level7 level53)
(sum level46 level8 level54)
(sum level46 level10 level56)
(sum level47 level3 level50)
(sum level47 level5 level52)
(sum level47 level6 level53)
(sum level47 level7 level54)
(sum level47 level8 level55)
(sum level47 level10 level57)
(sum level48 level3 level51)
(sum level48 level5 level53)
(sum level48 level6 level54)
(sum level48 level7 level55)
(sum level48 level8 level56)
(sum level48 level10 level58)
(sum level49 level3 level52)
(sum level49 level5 level54)
(sum level49 level6 level55)
(sum level49 level7 level56)
(sum level49 level8 level57)
(sum level49 level10 level59)
(sum level50 level3 level53)
(sum level50 level5 level55)
(sum level50 level6 level56)
(sum level50 level7 level57)
(sum level50 level8 level58)
(sum level50 level10 level60)
(sum level51 level3 level54)
(sum level51 level5 level56)
(sum level51 level6 level57)
(sum level51 level7 level58)
(sum level51 level8 level59)
(sum level51 level10 level61)
(sum level52 level3 level55)
(sum level52 level5 level57)
(sum level52 level6 level58)
(sum level52 level7 level59)
(sum level52 level8 level60)
(sum level52 level10 level62)
(sum level53 level3 level56)
(sum level53 level5 level58)
(sum level53 level6 level59)
(sum level53 level7 level60)
(sum level53 level8 level61)
(sum level53 level10 level63)
(sum level54 level3 level57)
(sum level54 level5 level59)
(sum level54 level6 level60)
(sum level54 level7 level61)
(sum level54 level8 level62)
(sum level54 level10 level64)
(sum level55 level3 level58)
(sum level55 level5 level60)
(sum level55 level6 level61)
(sum level55 level7 level62)
(sum level55 level8 level63)
(sum level56 level3 level59)
(sum level56 level5 level61)
(sum level56 level6 level62)
(sum level56 level7 level63)
(sum level56 level8 level64)
(sum level57 level3 level60)
(sum level57 level5 level62)
(sum level57 level6 level63)
(sum level57 level7 level64)
(sum level58 level3 level61)
(sum level58 level5 level63)
(sum level58 level6 level64)
(sum level59 level3 level62)
(sum level59 level5 level64)
(sum level60 level3 level63)
(sum level61 level3 level64)

(connected l0 l1)
(fuelcost level5 l0 l1)
(connected l0 l2)
(fuelcost level10 l0 l2)
(connected l0 l3)
(fuelcost level3 l0 l3)
(connected l1 l0)
(fuelcost level5 l1 l0)
(connected l1 l4)
(fuelcost level7 l1 l4)
(connected l2 l0)
(fuelcost level10 l2 l0)
(connected l2 l3)
(fuelcost level6 l2 l3)
(connected l2 l4)
(fuelcost level3 l2 l4)
(connected l3 l0)
(fuelcost level3 l3 l0)
(connected l3 l2)
(fuelcost level6 l3 l2)
(connected l3 l4)
(fuelcost level8 l3 l4)
(connected l4 l1)
(fuelcost level7 l4 l1)
(connected l4 l2)
(fuelcost level3 l4 l2)
(connected l4 l3)
(fuelcost level8 l4 l3)

(at t0 l4)
(fuel t0 level64)
(= (total-cost) 0)

(at p0 l3)
(at p1 l0)
(at p2 l1)
(at p3 l0)
(at p4 l3)
(at p5 l3)
(at p6 l1)
(at p7 l3)
(at p8 l0)
(at p9 l4)
(at p10 l1)
(at p11 l4)
(at p12 l1)
)

(:goal
(and
(at p0 l1)
(at p1 l4)
(at p2 l4)
(at p3 l3)
(at p4 l0)
(at p5 l2)
(at p6 l3)
(at p7 l0)
(at p8 l1)
(at p9 l0)
(at p10 l4)
(at p11 l1)
(at p12 l3)
)
)
(:metric minimize (total-cost)))

; plan
1. (load p9 t0 l4)
   deleted: (at p9 l4)
   added: (in p9 t0)
   goals met: 0 of 13
2. (load p11 t0 l4)
   deleted: (at p11 l4)
   added: (in p11 t0)
   goals met: 0 of 13
3. (drive t0 l4 l3 level56 level8 level64)
   deleted: (at t0 l4) (fuel t0 level64)
   added: (at t0 l3) (fuel t0 level56)
   goals met: 0 of 13
4. (load p7 t0 l3)
   deleted: (at p7 l3)
   added: (in p7 t0)
   goals met: 0 of 13
5. (load p5 t0 l3)
   deleted: (at p5 l3)
   added: (in p5 t0)
   goals met: 0 of 13
6. (load p4 t0 l3)
   deleted: (at p4 l3)
   added: (in p4 t0)
   goals met: 0 of 13
7. (load p0 t0 l3)
   deleted: (at p0 l3)
   added: (in p0 t0)
   goals met: 0 of 13
8. (drive t0 l3 l2 level50 level6 level56)
   deleted: (at t0 l3) (fuel t0 level56)
   added: (at t0 l2) (fuel t0 level50)
   goals met: 0 of 13
9. (unload p5 t0 l2)
   deleted: (in p5 t0)
   added: (at p5 l2)
   goals met: 1 of 13
10. (drive t0 l2 l0 level40 level10 level50)
   deleted: (at t0 l2) (fuel t0 level50)
   added: (at t0 l0) (fuel t0 level40)
   goals met: 1 of 13
11. (unload p9 t0 l0)
   deleted: (in p9 t0)
   added: (at p9 l0)
   goals met: 2 of 13
12. (unload p7 t0 l0)
   deleted: (in p7 t0)
   added: (at p7 l0)
   goals met: 3 of 13
13. (unload p4 t0 l0)
   deleted: (in p4 t0)
   added: (at p4 l0)
   goals met: 4 of 13
14. (load p8 t0 l0)
   deleted: (at p8 l0)
   added: (in p8 t0)
   goals met: 4 of 13
15. (load p3 t0 l0)
   deleted: (at p3 l0)
   added: (in p3 t0)
   goals met: 4 of 13
16. (load p1 t0 l0)
   deleted: (at p1 l0)
   added: (in p1 t0)
   goals met: 4 of 13
17. (drive t0 l0 l1 level35 level5 level40)
   deleted: (at t0 l0) (fuel t0 level40)
   added: (at t0 l1) (fuel t0 level35)
   goals met: 4 of 13
18. (load p10 t0 l1)
   deleted: (at p10 l1)
   added: (in p10 t0)
   goals met: 4 of 13
19. (load p12 t0 l1)
   deleted: (at p12 l1)
   added: (in p12 t0)
   goals met: 4 of 13
20. (load p2 t0 l1)
   deleted: (at p2 l1)
   added: (in p2 t0)
   goals met: 4 of 13
21. (load p6 t0 l1)
   deleted: (at p6 l1)
   added: (in p6 t0)
   goals met: 4 of 13
22. (unload p0 t0 l1)
   deleted: (in p0 t0)
   added: (at p0 l1)
   goals met: 5 of 13
23. (unload p11 t0 l1)
   deleted: (in p11 t0)
   added: (at p11 l1)
   goals met: 6 of 13
24. (unload p8 t0 l1)
   deleted: (in p8 t0)
   added: (at p8 l1)
   goals met: 7 of 13
25. (drive t0 l1 l4 level28 level7 level35)
   deleted: (at t0 l1) (fuel t0 level35)
   added: (at t0 l4) (fuel t0 level28)
   goals met: 7 of 13
26. (unload p1 t0 l4)
   deleted: (in p1 t0)
   added: (at p1 l4)
   goals met: 8 of 13
27. (unload p10 t0 l4)
   deleted: (in p10 t0)
   added: (at p10 l4)
   goals met: 9 of 13
28. (unload p2 t0 l4)
   deleted: (in p2 t0)
   added: (at p2 l4)
   goals met: 10 of 13
29. (drive t0 l4 l3 level20 level8 level28)
   deleted: (at t0 l4) (fuel t0 level28)
   added: (at t0 l3) (fuel t0 level20)
   goals met: 10 of 13
30. (unload p12 t0 l3)
   deleted: (in p12 t0)
   added: (at p12 l3)
   goals met: 11 of 13
31. (unload p3 t0 l3)
   deleted: (in p3 t0)
   added: (at p3 l3)
   goals met: 12 of 13
32. (unload p6 t0 l3)
   deleted: (in p6 t0)
   added: (at p6 l3)
   goals met: 13 of 13
